using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ArrayTasks
{
    class Program
    {
        static void Main(string[] args)
        {

        }

        static void Task_4_1()
        {
            //4.1 Удалить в массиве все числа, которые повторяются более двух раз.
        }

        static void Task_4_2()
        {
            //4.2 Введите одномерный целочисленный массив. Найдите наибольший
            //нечетный элемент. Далее трижды осуществите циклический сдвиг влево
            //элементов, стоящих справа от найденного максимума, и один раз сдвиг
            //элементов вправо, стоящих слева от найденного максимума.
        }

        static void Task_4_3()
        {
            //4.3 Найдите сумму отрицательных элементов массива.
        }

        static void Task_4_4()
        {
            //4.4 Найдите произведение элементов массива с нечетными номерами.
        }

        static void Task_4_5()
        {
            //4.5 Найдите сумму элементов массива между двумя первыми нулями.
            //Если двух нулей нет в массиве, то выведите ноль.
        }

        static void Task_4_6()
        {
            //4.6 Найдите наибольший элемент массива.
        }

        static void Task_4_7()
        {
            //4.7 Найдите наименьший четный элемент массива.Если такого нет, то
            //выведите первый элемент.
        }

        static void Task_4_8()
        {
            //4.8 Преобразовать массив так, чтобы сначала шли нулевые элементы, а
            //затем все остальные.
        }

        static void Task_4_9()
        {
            //4.9 Найдите сумму номеров минимального и максимального элементов.
        }

        static void Task_4_10()
        {
            //4.10 Найтиподмножество данного множества чисел такое, что сумма его
            //элементов равна заданному числу.
        }

        static void Task_4_11()
        {
            //4.11 Напишите программу бинарного поиска по ключу в массиве целых
            //чисел.
        }
    }
}
